artillery/auth-test.yaml
config:
  target: 'http://localhost:8080'
  phases:
    - duration: 60
      arrivalRate: 30
  defaults:
    headers:
      'Content-Type': 'application/json'

scenarios:
  - name: 'auth'
    flow:
      - post:
          url: '/auth/register'
          json:
            username: 'art_{{ $randomString(8) }}'
            password: 'password'
          capture:
            - json: '$.user.username'
              as: 'username'
          expect:
            - statusCode: 201

      - post:
          url: '/auth/login'
          json:
            username: '{{ username }}'
            password: 'password'
          expect:
            - statusCode: 200

      - get:
          url: '/auth/me'
          expect:
            - statusCode: 200
            - json: '$.success'
              value: true
            - hasProperty: 'user'